---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidType.GetFluidTemperatureSetIterator
source: html/890a61fc-60fe-b8bf-6f64-ebf94618493a.htm
---
# Autodesk.Revit.DB.Plumbing.FluidType.GetFluidTemperatureSetIterator Method

Returns a FluidTemperatureSetIterator that iterates through the collection.

## Syntax (C#)
```csharp
public FluidTemperatureSetIterator GetFluidTemperatureSetIterator()
```

## Returns
A FluidTemperatureSetIterator object that can be used to iterate through key-value pairs in the collection.